cases/stationaryDroplet2D/system/blockMeshDict.template
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// 2D stationary-droplet benchmark (arXiv:2212.02904, Sec. 3.3.1): a
// 0.01 x 0.01 m^2 box, one cell thick. n_cells is swept by the study
// (@!N_CELLS!@ = 32, 64, 128, 256); z thickness is fixed (empty front/back => 2D).

scale   1;

n_cells @!N_CELLS!@;

vertices
(
    (0     0     -1.5625e-4)
    (0.01  0     -1.5625e-4)
    (0.01  0.01  -1.5625e-4)
    (0     0.01  -1.5625e-4)
    (0     0      1.5625e-4)
    (0.01  0      1.5625e-4)
    (0.01  0.01   1.5625e-4)
    (0     0.01   1.5625e-4)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($n_cells $n_cells 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (0 4 7 3)   // left
            (2 6 5 1)   // right
            (3 7 6 2)   // top
            (1 5 4 0)   // bottom
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)   // back
            (4 5 6 7)   // front
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
